public class Main {

    public static void main(String[] args)
    {
       // Создайте две задачи
       // создать эпик с двумя подзадачами
       // создатьэпик с одной подзадачей.
       // Распечатайте списки эпиков, задач и подзадач через System.out.println(..).
       // Измените статусы созданных объектов, распечатайте их.
       // Проверьте, что статус задачи и подзадачи сохранился, а статус эпика рассчитался по статусам подзадач.
       // удалить одну из задач
       // удалить один из эпиков
    }
}
